src/InformationRegisters/Scan_ОпределяемыеПараметрыПоОпциямПродуктов/Scan_ОпределяемыеПараметрыПоОпциямПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ОпределяемыеПараметрыПоОпциямПродуктов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>CatalogRef.Scan_ОпределяемыеПараметрыПоОпциямПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыСочетанияОпций/Scan_ТипыСочетанияОпций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСочетанияОпций</name>
  <enumValues>
    <name>ВсеОдновременно</name>
  </enumValues>
  <enumValues>
    <name>ОднаИзСписка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_ОпределяемыеПараметрыПоОпциямПродуктов/Scan_ОпределяемыеПараметрыПоОпциямПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ОпределяемыеПараметрыПоОпциямПродуктов</name>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйПараметрПродукта</name>
    <type>
      <types>CatalogRef.Scan_ДополнительныеПараметрыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеДополнительногоПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСочетанияОпций</name>
    <type>
      <types>EnumRef.Scan_ТипыСочетанияОпций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпций</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_ВерсииБазовыхСпецификаций/Scan_ВерсииБазовыхСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВерсииБазовыхСпецификаций</name>
  <owners>Catalog.Scan_СпецификацииПродуктов</owners>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпецификации</name>
    <type>
      <types>CatalogRef.Scan_ВидыСпецификацийПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаОпций</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Использование</name>
    <attributes>
      <name>ОбъектИспользования</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
        <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСпецификации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_ВидыСпецификацийПродуктов/Scan_ВидыСпецификацийПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВидыСпецификацийПродуктов</name>
  <predefined>
    <items>
      <name>COWСпецификацияЗаказанная</name>
      <description>COW спецификация заказанная</description>
    </items>
    <items>
      <name>COWСпецификацияЛокальная</name>
      <description>COW спецификация локальная</description>
    </items>
    <items>
      <name>COWСпецификацияПодтвержденнаяЗаводом</name>
      <description>COW спецификация подтвержденная заводом</description>
    </items>
    <items>
      <name>SPIIСпецификация</name>
      <description>SPII спецификация</description>
    </items>
    <items>
      <name>SPORTСпецификация</name>
      <description>SPORT спецификация</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Scan_ОпределяемыеПараметрыПоОпциямПродуктов/ManagerModule.bsl
//процедура обновляет определяемые параметры
Процедура ОбновитьОпределяемыеПараметры(ИзделиеСсылка) Экспорт //rarus bonmak 08.10.2019 14177 ++
			
	ТаблицаОпций = ПолучитьПоследнююТаблицуБазовыхОпций(ИзделиеСсылка);
	
	Если ТаблицаОпций.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОпций.Опция КАК Опция
		|ПОМЕСТИТЬ ТабОпции
		|ИЗ
		|	&ТаблицаОпций КАК ТаблицаОпций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка.ТипСочетанияОпций = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСочетанияОпций.ВсеОдновременно)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбщееКолвоОдновременно
		|ПОМЕСТИТЬ ОбщееКоличествоОдновременно
		|ИЗ
		|	Справочник.Scan_ОпределяемыеПараметрыПоОпциямПродуктов.СписокОпций КАК Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций
		|ГДЕ
		|	Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка.Используется
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка.ТипСочетанияОпций = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСочетанияОпций.ВсеОдновременно)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОдновременноКоличество
		|ПОМЕСТИТЬ ПромежуточнаяТаблица
		|ИЗ
		|	ТабОпции КАК ТабОпции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Scan_ОпределяемыеПараметрыПоОпциямПродуктов.СписокОпций КАК Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций
		|		ПО ТабОпции.Опция = Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Опция
		|ГДЕ
		|	Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка.Используется
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_ОпределяемыеПараметрыПоОпциямПродуктовСписокОпций.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПромежуточнаяТаблица.Ссылка КАК Параметр
		|ПОМЕСТИТЬ ТаблицаСНовымиПараметрами
		|ИЗ
		|	ПромежуточнаяТаблица КАК ПромежуточнаяТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщееКоличествоОдновременно КАК ОбщееКоличествоОдновременно
		|		ПО ПромежуточнаяТаблица.Ссылка = ОбщееКоличествоОдновременно.Ссылка
		|ГДЕ
		|	ПромежуточнаяТаблица.ОдновременноКоличество = ОбщееКоличествоОдновременно.ОбщееКолвоОдновременно
		|
		|СГРУППИРОВАТЬ ПО
		|	ПромежуточнаяТаблица.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Период, &ТекДата) КАК Период,
		|	ЕСТЬNULL(Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Изделие, &Изделие) КАК Изделие,
		|	ЕСТЬNULL(Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Параметр, ТаблицаСНовымиПараметрами.Параметр) КАК Параметр,
		|	ВЫБОР
		|		КОГДА ТаблицаСНовымиПараметрами.Параметр ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Удалить
		|ИЗ
		|	РегистрСведений.Scan_ОпределяемыеПараметрыПоОпциямПродуктов.СрезПоследних(, Изделие = &Изделие) КАК Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаСНовымиПараметрами КАК ТаблицаСНовымиПараметрами
		|		ПО Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Параметр = ТаблицаСНовымиПараметрами.Параметр
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Период, &ТекДата),
		|	ЕСТЬNULL(Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Изделие, &Изделие),
		|	ВЫБОР
		|		КОГДА ТаблицаСНовымиПараметрами.Параметр ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ЕСТЬNULL(Scan_ОпределяемыеПараметрыПоОпциямПродуктовСрезПоследних.Параметр, ТаблицаСНовымиПараметрами.Параметр)";
	
	ТекДата = ТекущаяДата();
	Запрос.УстановитьПараметр("Изделие", ИзделиеСсылка);
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("ТаблицаОпций", ТаблицаОпций);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = РегистрыСведений.Scan_ОпределяемыеПараметрыПоОпциямПродуктов.СоздатьМенеджерЗаписи();
		Запись.Изделие = ВыборкаДетальныеЗаписи.Изделие;
		Запись.Параметр = ВыборкаДетальныеЗаписи.Параметр;
		Запись.Период = ВыборкаДетальныеЗаписи.Период;
		Запись.Прочитать();
		Если ВыборкаДетальныеЗаписи.Удалить Тогда
			Запись.Удалить();
		ИначеЕсли НЕ Запись.Выбран() Тогда
			Запись.Период = ТекДата;
			Запись.Изделие = ВыборкаДетальныеЗаписи.Изделие;
			Запись.Параметр = ВыборкаДетальныеЗаписи.Параметр;
			Запись.Записать();	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

//функция получает таблицу опций последнего вида базовых опций
//обновлять определяемые параметры следует согласно имеющейся версии спецификации(если нет 1, то список опций берется из 2 и так далее)
//1 COW спецификация подтвержденная заводом
//2 COW спецификация заказанная (примечание: это 1-я версия спецификации из COW = спецификации SPORT при размещении заказа на завод)
//3 SPORT спецификация (ее получать в момент загрузки данных по КП в заявке на СОП)

Функция ПолучитьПоследнююТаблицуБазовыхОпций(ИзделиеСсылка) //rarus bonmak 08.10.2019 14177 ++	
	ТаблицаОпций = Новый ТаблицаЗначений;
	//ТаблицаОпций.Колонки.Добавить("Опция", Новый ОписаниеТипов("СправочникСсылка.Scan_ОпцииПродуктов"));

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ВерсииБазовыхСпецификаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_ВерсииБазовыхСпецификаций КАК Scan_ВерсииБазовыхСпецификаций
		|ГДЕ
		|	Scan_ВерсииБазовыхСпецификаций.Владелец.Изделие = &Изделие
		|	И НЕ Scan_ВерсииБазовыхСпецификаций.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Scan_ВерсииБазовыхСпецификаций.Код";
	
	Запрос.УстановитьПараметр("Изделие", ИзделиеСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НужнаяСпецификация = Справочники.Scan_ВерсииБазовыхСпецификаций.ПустаяСсылка();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//список упорядочен по возрастанию кода
		Если ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.SPORTСпецификация Тогда
			НужнаяСпецификация = ВыборкаДетальныеЗаписи.Ссылка; 
		ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.COWСпецификацияЗаказанная Тогда
			НужнаяСпецификация = ВыборкаДетальныеЗаписи.Ссылка;
		ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.COWСпецификацияПодтвержденнаяЗаводом Тогда
			НужнаяСпецификация = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ НужнаяСпецификация.Пустая() Тогда
		ТаблицаОпций = НужнаяСпецификация.РасшифровкаОпций.Выгрузить();		
	КонецЕсли;
	
Возврат ТаблицаОпций;		
КонецФункции //rarus bonmak 08.10.2019 14177 --
